#### Cluster ☸️ `Development`

#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
google_logging_project_bucket_config.cert_manager: Refreshing state... [id=projects/rkways-gke-04-dev/locations/global/buckets/cert-manager]
google_kms_key_ring.gke: Refreshing state... [id=projects/rkways-gke-04-dev/locations/europe-west2/keyRings/krampus-dev]
google_logging_project_bucket_config.default: Refreshing state... [id=projects/rkways-gke-04-dev/locations/global/buckets/_Default]
google_kms_crypto_key.root_disk: Refreshing state... [id=projects/rkways-gke-04-dev/locations/europe-west2/keyRings/krampus-dev/cryptoKeys/k8s-root-disk]
google_kms_crypto_key.db: Refreshing state... [id=projects/rkways-gke-04-dev/locations/europe-west2/keyRings/krampus-dev/cryptoKeys/k8s-db]
google_kms_crypto_key.sc_storageclass_cmek_disk: Refreshing state... [id=projects/rkways-gke-04-dev/locations/europe-west2/keyRings/krampus-dev/cryptoKeys/k8s-sc-storageclass-cmek-disk]
google_kms_crypto_key_iam_binding.crypto_key_root_disk: Refreshing state... [id=projects/rkways-gke-04-dev/locations/europe-west2/keyRings/krampus-dev/cryptoKeys/k8s-root-disk/roles/cloudkms.cryptoKeyEncrypterDecrypter]
google_kms_crypto_key_iam_binding.crypto_key_db: Refreshing state... [id=projects/rkways-gke-04-dev/locations/europe-west2/keyRings/krampus-dev/cryptoKeys/k8s-db/roles/cloudkms.cryptoKeyEncrypterDecrypter]
google_kms_crypto_key_iam_binding.crypto_key_sc_storageclass_cmek_disk: Refreshing state... [id=projects/rkways-gke-04-dev/locations/europe-west2/keyRings/krampus-dev/cryptoKeys/k8s-sc-storageclass-cmek-disk/roles/cloudkms.cryptoKeyEncrypterDecrypter]
module.gke.random_string.cluster_service_account_suffix: Refreshing state... [id=9aqv]
module.gke.google_service_account.cluster_service_account[0]: Refreshing state... [id=projects/rkways-gke-04-dev/serviceAccounts/tf-gke-krampus-dev-9aqv@rkways-gke-04-dev.iam.gserviceaccount.com]
module.gke.google_project_iam_member.cluster_service_account-log_writer[0]: Refreshing state... [id=rkways-gke-04-dev/roles/logging.logWriter/serviceaccount:tf-gke-krampus-dev-9aqv@rkways-gke-04-dev.iam.gserviceaccount.com]
module.gke.google_project_iam_member.cluster_service_account-artifact-registry[0]: Refreshing state... [id=rkways-gke-04-dev/roles/artifactregistry.reader/serviceaccount:tf-gke-krampus-dev-9aqv@rkways-gke-04-dev.iam.gserviceaccount.com]
module.gke.google_project_iam_member.cluster_service_account-gcr[0]: Refreshing state... [id=rkways-gke-04-dev/roles/storage.objectViewer/serviceaccount:tf-gke-krampus-dev-9aqv@rkways-gke-04-dev.iam.gserviceaccount.com]
module.gke.random_shuffle.available_zones: Refreshing state... [id=-]
module.gke.google_project_iam_member.cluster_service_account-metric_writer[0]: Refreshing state... [id=rkways-gke-04-dev/roles/monitoring.metricWriter/serviceaccount:tf-gke-krampus-dev-9aqv@rkways-gke-04-dev.iam.gserviceaccount.com]
module.gke.google_container_cluster.primary: Refreshing state... [id=projects/rkways-gke-04-dev/locations/europe-west2-b/clusters/krampus-dev]
module.gke.google_project_iam_member.cluster_service_account-monitoring_viewer[0]: Refreshing state... [id=rkways-gke-04-dev/roles/monitoring.viewer/serviceaccount:tf-gke-krampus-dev-9aqv@rkways-gke-04-dev.iam.gserviceaccount.com]
module.gke.google_container_node_pool.pools["default-node-pool"]: Refreshing state... [id=projects/rkways-gke-04-dev/locations/europe-west2-b/clusters/krampus-dev/nodePools/default-node-pool]
module.gcloud_no_default_standard_storageclass.module.gcloud_kubectl.null_resource.module_depends_on[0]: Refreshing state... [id=1822657146905636597]
module.gcloud_no_default_standard_storageclass.module.gcloud_kubectl.null_resource.additional_components[0]: Refreshing state... [id=1081359029269672092]
module.gcloud_no_default_standard_storageclass.module.gcloud_kubectl.null_resource.run_destroy_command[0]: Refreshing state... [id=3776019257551434708]
module.gcloud_no_default_standard_storageclass.module.gcloud_kubectl.null_resource.run_command[0]: Refreshing state... [id=5580886573677564618]
module.gcloud_no_default_standard_storageclass.module.gcloud_kubectl.null_resource.additional_components_destroy[0]: Refreshing state... [id=7775271043067022153]
module.gke.google_project_iam_member.cluster_service_account-resourceMetadata-writer[0]: Refreshing state... [id=rkways-gke-04-dev/roles/stackdriver.resourceMetadata.writer/serviceaccount:tf-gke-krampus-dev-9aqv@rkways-gke-04-dev.iam.gserviceaccount.com]
module.gke.module.gcloud_delete_default_kube_dns_configmap.module.gcloud_kubectl.null_resource.module_depends_on[0]: Refreshing state... [id=380207887692263381]
kubernetes_namespace.cert_manager: Refreshing state... [id=cert-manager]
kubernetes_storage_class.standard_cmek: Refreshing state... [id=standard-cmek]
kubernetes_storage_class.premium_rwo_cmek: Refreshing state... [id=premium-rwo-cmek]
kubernetes_storage_class.standard_rwo_cmek: Refreshing state... [id=standard-rwo-cmek]
google_logging_project_sink.cert_manager: Refreshing state... [id=projects/rkways-gke-04-dev/sinks/cert-manager]
google_logging_project_exclusion.cert_manager: Refreshing state... [id=projects/rkways-gke-04-dev/exclusions/cert-manager]
helm_release.cert_manager: Refreshing state... [id=cert-manager]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # kubernetes_secret.cert_manager_cf[0] will be created
  + resource "kubernetes_secret" "cert_manager_cf" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "cloudflare-api-token-secret"
          + namespace        = "cert-manager"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ client_token = (sensitive value)
```

</details>

*Pusher: @kupson, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*